test/fixtures/files/stripe/invoice.payment_failed.json

{
  "object": {
    "id": "in_1234",
    "object": "invoice",
    "account_country": "US",
    "account_name": "Example, LLC",
    "account_tax_ids": null,
    "amount_due": 24900,
    "amount_overpaid": 0,
    "amount_paid": 0,
    "amount_remaining": 24900,
    "amount_shipping": 0,
    "application": null,
    "attempt_count": 1,
    "attempted": true,
    "auto_advance": true,
    "automatic_tax": {
      "disabled_reason": null,
      "enabled": false,
      "liability": null,
      "provider": null,
      "status": null
    },
    "automatically_finalizes_at": null,
    "billing_reason": "subscription_cycle",
    "collection_method": "charge_automatically",
    "created": 1745433962,
    "currency": "usd",
    "custom_fields": null,
    "customer": "cus_1234",
    "customer_address": {
      "city": null,
      "country": "US",
      "line1": null,
      "line2": null,
      "postal_code": "94587",
      "state": null
    },
    "customer_email": "customer@example.org",
    "customer_name": "Example Customer",
    "customer_phone": null,
    "customer_shipping": null,
    "customer_tax_exempt": "none",
    "customer_tax_ids": [],
    "default_payment_method": null,
    "default_source": null,
    "default_tax_rates": [],
    "description": null,
    "discounts": [],
    "due_date": null,
    "effective_at": 1745437578,
    "ending_balance": 0,
    "footer": null,
    "from_invoice": null,
    "hosted_invoice_url": "https://invoice.stripe.com/",
    "invoice_pdf": "https://pay.stripe.com/",
    "issuer": {
      "type": "self"
    },
    "last_finalization_error": null,
    "latest_revision": null,
    "lines": {
      "object": "list",
      "data": [
        {
          "id": "il_1234",
          "object": "line_item",
          "amount": 24900,
          "currency": "usd",
          "description": "1 × Example (at $249.00 / year)",
          "discount_amounts": [],
          "discountable": true,
          "discounts": [],
          "invoice": "in_1234",
          "livemode": true,
          "metadata": {
            "license_id": "0"
          },
          "parent": {
            "invoice_item_details": null,
            "subscription_item_details": {
              "invoice_item": null,
              "proration": false,
              "proration_details": {
                "credited_items": null
              },
              "subscription": "sub_1234",
              "subscription_item": "si_1234"
            },
            "type": "subscription_item_details"
          },
          "period": {
            "end": 1776969906,
            "start": 1745433906
          },
          "pretax_credit_amounts": [],
          "pricing": {
            "price_details": {
              "price": "price_1234",
              "product": "prod_1234"
            },
            "type": "price_details",
            "unit_amount_decimal": "24900"
          },
          "quantity": 1,
          "taxes": []
        }
      ],
      "has_more": false,
      "total_count": 1,
      "url": "/v1/invoices/in_1234/lines"
    },
    "livemode": true,
    "metadata": {},
    "next_payment_attempt": 1745552783,
    "number": "F612594F-0002",
    "on_behalf_of": null,
    "parent": {
      "quote_details": null,
      "subscription_details": {
        "metadata": {
          "license_id": "0"
        },
        "subscription": "sub_1234"
      },
      "type": "subscription_details"
    },
    "payment_settings": {
      "default_mandate": null,
      "payment_method_options": {
        "acss_debit": null,
        "bancontact": null,
        "card": {
          "request_three_d_secure": "automatic"
        },
        "customer_balance": null,
        "konbini": null,
        "sepa_debit": null,
        "us_bank_account": null
      },
      "payment_method_types": null
    },
    "period_end": 1745433906,
    "period_start": 1713897906,
    "post_payment_credit_notes_amount": 0,
    "pre_payment_credit_notes_amount": 0,
    "receipt_number": null,
    "rendering": {
      "amount_tax_display": "exclude_tax",
      "pdf": null,
      "template": null,
      "template_version": null
    },
    "shipping_cost": null,
    "shipping_details": null,
    "starting_balance": 0,
    "statement_descriptor": null,
    "status": "open",
    "status_transitions": {
      "finalized_at": 1745437578,
      "marked_uncollectible_at": null,
      "paid_at": null,
      "voided_at": null
    },
    "subtotal": 24900,
    "subtotal_excluding_tax": 24900,
    "test_clock": null,
    "total": 24900,
    "total_discount_amounts": [],
    "total_excluding_tax": 24900,
    "total_pretax_credit_amounts": [],
    "total_taxes": [],
    "webhooks_delivered_at": 1745433964
  },
  "previous_attributes": null
}
